[JediLight X2UniversalSoldierClassInfo]
ClassSpecializationTitle="Light Jedi"
ClassSpecializationSummary="A Jedi uses the Force for knowledge and defense...never for attack."

[JediGrey X2UniversalSoldierClassInfo]
ClassSpecializationTitle="Grey Jedi"
ClassSpecializationSummary="Balance of The Force is necessary for the universe to thrive. Without balance, everything falls apart…we are charged with maintaining this balance, which is how we realize the truth: all parts are needed to create a whole…"

[JediDark X2UniversalSoldierClassInfo]
ClassSpecializationTitle="Dark Jedi"
ClassSpecializationSummary="But beware of the dark side. Anger, fear, aggression…the dark side of the Force are they, easily they flow… If once you start down the dark path, forever will it dominate your destiny. Consume you, it will…"

